export const titles: any = {
  tab1: "AKT infratuzilmasi holati",
  tab2: "OTM axborot tizimlari, axborot resurslari holati",
  tab3: "OTM dagi AKT sohasidagi inson kapitali holati",
  tab4: "Rasmiy veb-saytning mavjudligi va undan foydalana olish",
  tab5: "Axborot xavfsizligini ta'minlashda meyoriy tadbirlar",
  tab6: "Tashkiliy ishlar",
};

export const givePages: any = {
  page1: {
    cardType: "small",
    title: "АКТ инфратузилмаси ҳолати",
    cards: [
      {
        url: "teacherEquipmentRate",
        title:
          "Профессор-ўқитyвчи ва ходимларнинг компьютер билан таъминланганлик холати",
        values: [
          {
            title:
              "Профессор-ўқитувчи ва ходимлар учун ажратилган компьютерлар сони",
            count: 0,
            url: "computerCount",
          },
          {
            title: "Профессор-ўқитувчи ва ходимлар умумий сони",
            count: 0,
            url: "totalTeacherCount",
          },
        ],
      },
      {
        url: "studentEquipmentRate",
        title: "Талабаларнинг компьютер билан таъминланганлик холати",
        values: [
          {
            title: "Талабалар фойдаланиши учун ажратилган компьютерлар сони",
            count: 0,
            url: "computerCount",
          },
          {
            title: "Талабаларнинг умумий сони",
            count: 0,
            url: "totalStudentCount",
          },
        ],
      },
      {
        url: "internetConnectedBuildingRate",
        title: "Интернет уланган ўқув, ТТЖ ва бошқа бинолар улуши",
        values: [
          {
            title: "Интернет уланган бинолар сони (Шартнома uлова қuлинади)",
            count: 0,
            url: "educationalBuildingCount",
          },
          {
            title: "Ўқув бинолари сони",
            count: 0,
            url: "buildingCount",
          },
          {
            title: "ТТЖлар сони",
            count: 0,
            url: "dormitoryCount",
          },
          {
            title: "Бошқа бинолар сони",
            count: 0,
            url: "otherBuildingCount",
          },
        ],
      },
      {
        url: "fiberOpticCoverageRate",
        title: "Оптик толали алоқа линиялари билан қамраб олинганлик улуши",
        values: [
          {
            title:
              "Оптик толали интернет уланган бинолар сони (Шартнома uлова қилинади)",
            count: 0,
            url: "buildingWithOpticCount",
          },
          {
            title: "Биноларнинг умумий сони",
            count: 0,
            url: "totalBuildingCount",
          },
        ],
      },
      {
        title: "Интернет тезлиги",
        url: "internetSpeed",
        values: [
          {
            title: "Ўқув биноларида интернетга уланиш ўртача тезлиги",
            url: "averageInternetSpeed",
            count: 0,
          },
          {
            title: "Талабаларнинг умумий сони",
            url: "totalStudentCount",
            count: 0,
          },
        ],
      },
      {
        url: "wirelessInternetRate",
        title: "Симсиз интернет қамрови ва сифати",
        values: [
          {
            title: "Симсиз интернет тарқатувчи қурилмалар сони",
            count: 0,
            url: "deviceCount",
          },
          {
            title: "Талабаларнинг умумий сони",
            count: 0,
            url: "totalStudentCount",
          },
          {
            title: "Профессор-ўқитувчи ва ходимлар умумий сони",
            count: 0,
            url: "totalTeacherCount",
          },
        ],
      },
      {
        url: "auditoriumEquipmentElectronicDevice",
        title:
          "Ўқув аудиторияларининг проектор, интерактив доска, катта диагоналли экранлар билан жихозланганлиги",
        values: [
          {
            title: "Ўқув аудиторияларидаги проекторлар сони",
            count: 0,
            url: "projectorCount",
          },
          {
            title: "Ўқув аудиторияларидагиинтерактив доскалар сони",
            count: 0,
            url: "blackboardCount",
          },
          {
            title: "Ўқув аудиторияларидаги катта диагоналли экранлар сони",
            count: 0,
            url: "screenCount",
          },
          {
            title: "Ўқув, аудиториялари сони",
            count: 0,
            url: "classRoomCount",
          },
        ],
      },
    ],
  },
  page2: {
    cardType: "big",
    title: "ОТМ ахборот тизимлари, ахборот ресурслари ҳолати",
    cards: [
      {
        title:
          "ОТМ фаолияти жараёнларини автоматлаштиришга йўналтирилган АТлар сони",
        values: [
          {
            title: "АТ ёки модул номи",
            count:
              "Олий таълим муассасаларининг магистратурасига кириш имтиҳонларида иштирок этиш учун онлайн ариза топшириш” ахборот тизими",
          },
          {
            title: "АТ ёки модул домени (линки)",
            count: "https://magistr.edu.uz/",
          },
          {
            title: "АТ ёки модулнинг мақсад ва вазифалари",
            count:
              "- абитуриентларнинг аризаларини қайд қилиш (аризаларни шакллантириш ва тегишли ҳужжатларни илова қилиш); - абитуриентларнинг аризаларини қабул қилиш (ОТМ қабул комиссияси томонидан аризаларни кўриб чиқиш, қабул қилиш ёки рад этиш); - абитуриентларнинг маълумотлар базасини яратиш (республиканинг барча ОТМлари абитуриентларининг ягона маълумотлар базасини яратиш); - магистратура мутахассисликлари ва уларга мувофиқ бакалавриат таълим йўналишлари рўйхатини яратиш; - магистратура қабул квоталарини киритиш (ОТМлар ва мутахассисликлар кесимида магистратура қабул квоталарини шакллантириш);",
          },
          {
            title: "Интеграция қилинган ахборот тизимлари рўйхати",
            count: "HEMIS ахборот тизими, Персоналлаштириш агентлиги",
          },
          {
            title: "Автоматлаштирилган хизматлар (функциялар)",
            count:
              "абитуриентларнинг аризаларини қайд қилиш (аризаларни шакллантириш ва тегишли ҳужжатларни илова қилиш);",
          },
        ],
      },
      {
        title:
          "ОТМ ўз ташаббуси асосида ишлаб чиққан ва жорий қилган АТ лари сони",
        values: [
          {
            title: "АТ тўлиқ номланиши",
            count: "AT",
          },
          {
            title: "АТ га ҳавола (линк)",
            count: "A;a/.",
          },
          {
            title: "АТнинг мақсад ва вазифалари",
            count:
              "(аризаларни шакллантириш ва тегишли ҳужжатларни илова қилиш); - абитуриентларнинг аризаларини қабул қилиш (ОТМ қабул комиссияси томонидан аризаларни кўриб чиқиш, қабул қилиш ёки рад этиш); - абитуриентларнинг маълумотлар базасини яратиш (республиканинг барча ОТМлари абитуриентларининг ягона маълумотлар базасини яратиш); - магистратура мутахассисликлари ва уларга мувофиқ бакалавриат таълим йўналишлари рўйхатини яратиш; - магистратура қабул квоталарини киритиш (ОТМлар ва мутахассисликлар кесимида магистратура қабул квоталарини шакллантириш);",
          },
          {
            title: "Интеграция қилинган ахборот тизимлари рўйхати",
            count: "HEMIS ахборот тизими, Персоналлаштириш агентлиги",
          },
          {
            title: "Автоматлаштирилган хизматлар (функциялар)",
            count:
              "абитуриентларнинг аризаларини қайд қилиш (аризаларни шакллантириш ва тегишли ҳужжатларни илова қилиш);",
          },
          {
            title: "Фойдаланувчилар сони",
            count: "10",
          },
          {
            title:
              "АТга тегишли хужжатлар (эксперт хулосаси, гувоҳнома, патент, сертификат ва ҳ.к.)",
            count: "link",
          },
        ],
      },
      {
        title:
          "HEMlS ёки ўз LMS тизими мавжудлиги ва унга маълумотларни киритилганлик холати",
        values: [],
      },
      {
        title:
          " LMS тизимига киритилган ОТМдаги фанлар бўйича материаллар сони ва сифати",
        values: [],
      },
      {
        title: "Тақдим қилинаётган электрон хизматлар сони",
        values: [
          {
            title: "Электрон хизмат номи",
            count:
              "Олий таълим муассасаларининг магистратурасига кириш имтиҳонларида иштирок этиш учун онлайн ариза топшириш” ахборот тизими",
          },
          {
            title: "Электрон хизматга ҳавола (линк)",
            count: "https://magistr.edu.uz/",
          },
          {
            title: "Электрон хизматнинг мақсад ва вазифалари",
            count:
              "- абитуриентларнинг аризаларини қайд қилиш (аризаларни шакллантириш ва тегишли ҳужжатларни илова қилиш); - абитуриентларнинг аризаларини қабул қилиш (ОТМ қабул комиссияси томонидан аризаларни кўриб чиқиш, қабул қилиш ёки рад этиш); - абитуриентларнинг маълумотлар базасини яратиш (республиканинг барча ОТМлари абитуриентларининг ягона маълумотлар базасини яратиш); - магистратура мутахассисликлари ва уларга мувофиқ бакалавриат таълим йўналишлари рўйхатини яратиш; - магистратура қабул квоталарини киритиш (ОТМлар ва мутахассисликлар кесимида магистратура қабул квоталарини шакллантириш);",
          },
          {
            title:
              "Электрон хизматни ишга туширишда интеграция қилинган АТлари рўйхати",
            count: "HEMIS ахборот тизими, Персоналлаштириш агентлиги",
          },
          {
            title: "Электрон хизматдан фойдаланганлар сони",
            count:
              "абитуриентларнинг аризаларини қайд қилиш (аризаларни шакллантириш ва тегишли ҳужжатларни илова қилиш);",
          },
          {
            title:
              "Электрон хизматга тегишли хужжатлар (эксперт хулосаси, гувоҳнома, патент, сертификат ва ҳ.к.)",
            count:
              "абитуриентларнинг аризаларини қайд қилиш (аризаларни шакллантириш ва тегишли ҳужжатларни илова қилиш);",
          },
        ],
      },
      {
        title:
          "ОТМ даги йўналиш ва мутахассисликлар учун йўналтирилган махсус замонавий АТ ларидан фойдаланиш даражаси",
        values: [
          {
            title: "ОТМ ўқув жараёнида фойдаланиладиган замонавий АТ лари сони",
            count: "200",
          },
          {
            title: "ОТМ даги йўналиш ва мутахассисликларнинг умумий сони",
            count: "100",
          },
        ],
      },
    ],
  },
};
