export const titles: any = {
  tab1: "АКТ инфратузилмаси ҳолати",
  tab1_1:
    "Профессор-ўқитyвчи ва ходимларнинг компьютер билан таъминланганлик холати",
  tab1_2: "Талабаларнинг компьютер билан таъминланганлик холати",
  tab1_3: "Интернет уланган ўқув, ТТЖ ва бошқа бинолар улуши",
  tab1_4: "Оптик толали алоқа линиялари билан қамраб олинганлик улуши",
  tab1_5: "Интернет тезлиги",
  tab1_6: "Симсиз интернет қамрови ва сифати",
  tab1_7: "Симсиз интернет қамрови ва сифати",

  tab2: "ОТМ ахборот тизимлари, ахборот ресурслари ҳолати",
  tab2_1:
    "ОТМ фаолияти жараёнларини автоматлаштиришга йўналтирилган АТлар сони",
  tab2_2: "ОТМ ўз ташаббуси асосида ишлаб чиққан ва жорий қилган АТ лари сони",
  tab2_3:
    "HEMIS ёки ўз LMS тизими мавжудлиги ва унга маълумотларни киритилганлик холати",
  tab2_4:
    "LMS тизимига киритилган ОТМдаги фанлар бўйича материаллар сони ва сифати",
  tab2_5: "Тақдим қилинаётган электрон хизматлар сони",
  tab2_6:
    "ОТМ даги йўналиш ва мутахассисликлар учун йўналтирилган махсус замонавий АТ ларидан фойдаланиш даражаси",

  tab3: "ОТМ даги АКТ соҳасидаги инсон капитали ҳолати",
  tab3_1: "АКТ бўйича ходимлар улуши (дастурчи ва АКТга масъуллар)",
  tab3_2:
    "АКТ бўйича малака оширган, онлайн ёки офлайн курсларни якунлаган ходимлар улуши (АКТ соҳаси мутахассиси бўлмаган ходимлар)",

  tab4: "Расмий веб-сайтнинг мавжудлиги ва ундан фойдалана олиш",
  tab4_1: "Расмий веб-сайтнинг мавжудлиги ва ундан фойдалана олиш",

  tab5: "Ахборот хавфсизлигини таъминлашдаги меъёрий тадбирлар",
  tab5_1:
    "Ахборот хавфсизлиги талаблари тасдиқланганлиги ва ходимларни таништирилганлиги ",
  tab5_2:
    "Конфиденциал маълумотлар ҳажми ва рўйхати, ходимлар билан конфиденциаллик келишуви (низоми) мавжудлиги",
  tab5_3:
    "Ахборот хавфсизлиги масалалари бўйича масъул раҳбар ҳамда ходимнинг тайинланганлиги",
  tab5_4: "Ахборот хавфсизлиги учун масъул ходимларнинг малака оширганлиги ",
  tab5_5:
    "Расмий веб-сайтнинг киберхавфсизлик талабларига кўра экспертизадан ўтказилганлиги (Камида 6 ойда бир марта экспертизадан ўтказиш талаб этилади)",
  tab5_6: "Расмий веб-сайт учун SSL сертификат мавжудлиги",
  tab5_7:
    "Ахборот тизимлари ҳамда ресурслари маълумотларининг захира нусхаланиши",
  tab5_8:
    "Конфиденциал ахборотни ташувчи воситаларни ҳисобга олиш ва сақлаш бўйича ишларнинг ташкил қилинганлиги",
  tab5_9:
    "Ишчи станциялар ва серверларда паролли ҳимоя воситаларини жорий қилинганлиги",
  tab5_10:
    "Сервер хоналарга (Ахборотлаштириш объектлари жойлаштирилган хоналарга) кириш учун рухсат берилган ходимлар тасдиқланганлиги",
  tab5_11: "Тармоқлараро экран (Firewall) мавжудлиги ",
  tab5_12: "Зарарли дастурлардан ҳимоя воситаларини жорий этилганлиги",
  tab5_13: "Видеоназорат тизими",

  tab6: "Ташкилий ишлар",
  tab6_1:
    "ОТМнинг молиялаштириш манбалари билан тасдиқланган, яқин йиллардаги фаолиятига АКТ жорий этиш ва ривожлантириш тадбирлари режаларининг мавжудлиги",
  tab6_2:
    "ОТМда АКТ жорий этиш ва ривожлантириш юзасидан раҳбарият орасидан масъул шахснинг мавжудлиги ",
  tab6_3:
    "ОТМда АКТ жорий этиш ва ривожлантириш юзасидан масъул бўлган ихтисослаштирилган таркибий бўлинманинг ёки тегишли хизматлар аутсорсинги бўйича шартноманинг мавжудлиги",
};

export const tabs: any = {
  1: 7,
  2: 6,
  3: 2,
  4: 1,
  5: 13,
  6: 3,
};
